export function getMockedNews() {
  return `<?xml version="1.0" encoding="UTF-8"?>
<rss version="2.0">
  <channel>
    <title>Сова рассылает</title>
    <description type="html"><![CDATA[Много говорю об effector, пишу на React всё самое сложное, руковожу фронтендом, практикую ночной Rust]]></description>
    <language>en-us</language>
    <link>http://news.sova.dev/</link>
    <item>
      <title>Сова рассылает выпуск #19</title>
      <description type="html"><![CDATA[<p>Привет всем!</p><p>Спустя почти три месяца я готов отправить вам новую подборку статей и книг в почту! На этот раз подборка разделена на секции: статьи по javascript, книги по проектированию API, некоторые полезные инсайты по дизайну и немного продуктивности от Github.</p><p>Приятного чтения 🧡</p>]]></description>
      <pubDate>Fri, 11 Nov 2022 13:04:11 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/19-1263486</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #18</title>
      <description type="html"><![CDATA[<p>Всем приятного дня!</p><p>Я уверен, что вы ждали этот выпуск. В этот раз я собрал весьма мясную подборку о самых разных аспектах frontend разработки.</p><p>С удовольствием буду выпускать подборки потрясающих статей для Вас регулярно, но сейчас я ищу новую работу, где могу применить свои навыки на практике, а также продаю квартиру, что отнимает довольно много сил и времени.</p><p>Приятного чтения 🧡</p>]]></description>
      <pubDate>Thu, 04 Aug 2022 10:04:57 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/18-1201069</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #17</title>
      <description type="html"><![CDATA[<p>После небольшого перерыва, а я возвращаюсь к Вам с новой странной подборкой!</p><p>Rust, оптимизации frontend, разработка своего языка программирования и немного полезных инструментов.</p>]]></description>
      <pubDate>Mon, 11 Jul 2022 06:32:45 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/17-1181475</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #16</title>
      <description type="html"><![CDATA[<p><br></p><p>С момента анонса моего вопроса про сервис поиска кратких решений прошло две недели. Если вы нашли что-то готовое, пожалуйста напишите мне в комментарии в <a href="https://t.me/sergeysova/560" target="_blank">Telegram канале</a>, мне всё еще это нужно.</p>]]></description>
      <pubDate>Mon, 30 May 2022 08:18:57 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/16-1164136</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #15</title>
      <description type="html"><![CDATA[<p>Сегодня я хочу предложить вам очень разномастный набор статей и проектов: react и производительность, javascript и typescript, фронтенд и бекенд архитектура, jwt vs сессии.</p><p>В отличие от предыдущих выпусков, на этот раз я хочу задать вопрос каждому разработчику. Пару лет назад у меня возникла потребность в сохранении и распространении небольших кусочков знаний, фактически решений понятных кейсов и я начал разрабатывать отдельный сервис.</p><p>Может быть такой сервис уже есть? В ближайшее время в своем <a href="https://t.me/sergeysova/560" target="_blank">канале в Telegram</a><span class="ql-cursor">﻿</span> я напишу список моих требований к такому сервису, пожалуйста, напишите свои идеи, как это можно реализовать или есть что-то готовое. <em>Комментарии открытые</em>.</p>]]></description>
      <pubDate>Mon, 16 May 2022 09:51:39 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/15-1139774</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #14</title>
      <description type="html"><![CDATA[<p>Node.js 18, поиск утечек памяти, производительность React и SSR практики тестирования в Javascript и Rust!</p>]]></description>
      <pubDate>Wed, 04 May 2022 07:37:16 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/14-1119050</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #13</title>
      <description type="html"><![CDATA[<p>Юбилейный 13 выпуск поможет любому читателю стать более эрудированным разработчиком. Последняя статья поможет изучить computer construction гораздо глубже.</p><p>Вообще, конечно это всё шутки, но советую читать каждую статью, хотя бы по диагонали, иначе Вы создаете для себя информационный пузырь того, что Вам интересно и пропускаете кучу полезной информации протекающей рядом. Пробуйте читать то, что кажется максимально не в тему и не интересно. Я считаю, что наша жизнь складывается из того, на что мы тратим своё время. А сейчас время становиться лучше и шире.</p><p>Будьте разработчиками <a href="https://jchyip.medium.com/why-t-shaped-people-e8706198e437" target="_blank">широкого профиля</a>!</p>]]></description>
      <pubDate>Mon, 18 Apr 2022 07:17:30 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/13-1059562</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #12</title>
      <description type="html"><![CDATA[<p>Сегодня много разнообразия в новостях и инструментах. Напоминаю, что у меня есть предложка в <a href="https://t.me/+DL1SujKlNJAwOGIy" target="_blank">Telegram чате</a>, достаточно тегнуть меня и скинуть новость или крутой инструмент, а я добавлю его в следующую подборку.</p><p>Желаю приятного прочтения, ставьте лайки, подписывайтесь на канал и жмите колокольчик 😏</p>]]></description>
      <pubDate>Mon, 04 Apr 2022 08:00:01 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/12-1036554</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #11</title>
      <description type="html"><![CDATA[<p>Этот выпуск должен был выйти гораздо раньше, сразу после моего отпуска. Но случилось всё то, что случилось. Лично мне очень осточертело думскроллить ужасные новости вперемешку с кучей фейков.</p><p>Я хочу продолжить вещать, так как это единственный для меня способ отвлечься и погрузиться в дело, которое я люблю хотя бы на один час в неделю. Надеюсь, что могу помочь хотя бы кому-то, кто испытывает подобные чувства.</p><p>Относительно всего происходящего на данный момент, хочу выразить глубочайшие соболезнования всем, кто пострадал от действия военных, правительства и пропаганды. Помимо физических травм тысячи людей потеряли друзей и членов семей из-за пропаганды и действия властей. Никому не желаю пережить того, что сейчас переживают люди на нашей планете совсем рядом от того места где вы находитесь. Ведь в масштабах нашей солнечной системы мы максимально близко и при этом находимся на грани самоуничтожения. Меня бросает в ужас от подобной картины современной геополитики.</p><p>Единственное о чем я сейчас прошу каждого, кто читает эту рассылку это попытаться отвлечься хотя бы на 10 минут от всего, что происходит вокруг, как минимум набраться сил, чтобы жить и выживать дальше. Всем максимальной силы духа, теплых отношений с теми близкими кто есть и прекращения отвратительной катастрофы!</p>]]></description>
      <pubDate>Thu, 17 Mar 2022 14:04:09 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/11-1004595</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #10</title>
      <description type="html"><![CDATA[<p>Я проснулся после новогоднего перерыва, желаю прочесть вам целую кучу статей на любой вкус: у нас есть CSS, Rust, React и Typescript.</p>]]></description>
      <pubDate>Mon, 24 Jan 2022 17:25:30 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/10-931476</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #9</title>
      <description type="html"><![CDATA[<p>Первый рабочий день этой недели подходит к концу. Декабрь вроде только начался, а уже чувствуется завершение всего года, хочется поскорее оторваться от привычных дел и переместиться в ностальгическое переживание Нового Года.</p>]]></description>
      <pubDate>Mon, 13 Dec 2021 12:57:56 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/9-907127</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #8</title>
      <description type="html"><![CDATA[<p>Смотрите на свой код как дизайнер смотрит на работу скульптора: вы не можете перенять подход как есть, но можете открыть для себя новое в привычных вещах.</p>]]></description>
      <pubDate>Tue, 30 Nov 2021 14:06:41 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/8-893329</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #7</title>
      <description type="html"><![CDATA[<p>Хотел бы назваться this-week-in-sova, но эта рассылка не выходит каждую неделю. Стараюсь подбирать полезные и интересные ссылочки, а не лишь бы заполнить выпуск к назначенному сроку. В связи с этим обновил название рассылки, не пугайтесь.</p><p>Закидывайте мне в <a href="http://twitter.com/_sergeysova" target="_blank">твиттер</a> или <a href="https://t.me/sovasergey" target="_blank">телегу</a> полезные ссылки, если вдруг найдете!</p>]]></description>
      <pubDate>Mon, 22 Nov 2021 12:11:54 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/7-850973</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #6</title>
      <description type="html"><![CDATA[<p>Доброго вечера вторника! Надеюсь ваш вечер проходит в спокойствии и здравии, посему я принес полезных ссылок.</p><p>А ещё я выпал из-за болезни на неделю, поэтому не публиковал рассылку раньше. Задонатить на лечение <a href="http://buymeacoffee.com/sergeysova" target="_blank">можно вот так</a>.</p>]]></description>
      <pubDate>Tue, 09 Nov 2021 16:52:07 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/6-816047</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #5</title>
      <description type="html"><![CDATA[<p>В сегодняшней подборке гораздо больше фана и повторений забытых полезных практик, нежели чего-то новенького.</p><p>Но помните мать ученья! 📚</p>]]></description>
      <pubDate>Mon, 18 Oct 2021 09:20:49 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/5-806332</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #4</title>
      <description type="html"><![CDATA[<p>Важно: я сюда кидаю не новые статьи, а которые я посчитал полезными. Если видите полезные статьи, которые стоит прочитать мне и поделиться с окружением, <a href="https://t.me/sovasergey" target="_blank">кидайте мне в личку</a>.</p>]]></description>
      <pubDate>Mon, 11 Oct 2021 13:02:02 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/4-795780</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #3</title>
      <description type="html"><![CDATA[<p>Я делюсь не только статьями по фронтенду или javascript, но и всем, что заинтересовало меня в сфере разработки, поэтому вы можете обнаружить здесь весьма внезапные ссылки 🙂</p>]]></description>
      <pubDate>Mon, 04 Oct 2021 14:10:44 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/3-779862</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #2</title>
      <description type="html"><![CDATA[<p>29 сентября у меня ДР. Можете поздравить меня <a href="http://buymeacoffee.com/sergeysova" target="_blank">материально</a> или в <a href="https://t.me/joinchat/h9xc48OB2zo5NTli" target="_blank">виде текста</a>, если хочется)</p><p>Шикарной вам рабочей недели!</p>]]></description>
      <pubDate>Mon, 27 Sep 2021 08:51:52 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/2-773353</link>
    </item>
    <item>
      <title>Сова рассылает выпуск #1</title>
      <description type="html"><![CDATA[<p>Всем привет!</p><p>Я стараюсь быть в курсе современных новостей во фронтенде, в течении недели читаю много статей. Но в моем списке есть статьи не только по React и вообще Frontend, есть ещё всякий Rust, и немного нативной разработки.</p><p>В первой рассылке я закидываю тулзы которые сам использую, а также некоторые полезные на мой взгляд ссылки.</p>]]></description>
      <pubDate>Mon, 20 Sep 2021 12:58:08 +0000</pubDate>
      <link>https://www.getrevue.co/profile/_sergeysova/issues/1-770989</link>
    </item>
  </channel>
</rss>
`;
}
